# Importing Data in Python

* Local File
    * Plain Text, csv, tsv
* DataBase
    * Sqlite, Mongodb
* Remote File
    * HTML, Json, Csv
* Excel File, Matlab .m File
* Web API - Facebook or Google API

# Reading Text file

In [2]:
file = open('news.txt', 'r')  # Without context manager

In [3]:
file.read()

'Why Infrastructure Is So Expensive \nA subway-style diagram of the major Roman roads\nBaby Bird from Time of Dinosaurs Found Fossilized\nMIT Gets $140M Pledge from Anonymous Donor (wsj.com)\nHow hackers abused satellites to stay under the radar (2015)\nFiduciary Rule Fight Brews While Bad Financial Advisers\nIn 1957, Five Men Agreed to Stand Under an Exploding Nuclear Bomb\n'

In [9]:
file.closed

False

In [10]:
file.close()

In [11]:
file.closed

True

In [ ]:
# With Context Manager

In [1]:
with open('news.txt','r') as file1:
    print(file1.read())

Why Infrastructure Is So Expensive
A subway-style diagram of the major Roman roads
Baby Bird from Time of Dinosaurs Found Fossilized
MIT Gets $140M Pledge from Anonymous Donor (wsj.com)
How hackers abused satellites to stay under the radar (2015)
Fiduciary Rule Fight Brews While Bad Financial Advisers
In 1957, Five Men Agreed to Stand Under an Exploding Nuclear Bomb

In [4]:
with open('news.txt','r') as file1:
    print(file1.readline())
    print(file1.readline())

Why Infrastructure Is So Expensive

A subway-style diagram of the major Roman roads

# Read .csv File

In [5]:
#numpy, pandas
import numpy as np
import pandas as pd

In [6]:
mnist_data = np.loadtxt('mnist.csv', dtype=float, comments='#', delimiter=',')

In [7]:
mnist_data

array([[5., 0., 0., ..., 0., 0., 0.],
       [4., 0., 0., ..., 0., 0., 0.],
       [1., 0., 0., ..., 0., 0., 0.],
       ...,
       [1., 0., 0., ..., 0., 0., 0.],
       [3., 0., 0., ..., 0., 0., 0.],
       [1., 0., 0., ..., 0., 0., 0.]])

In [8]:
titanic_data = np.genfromtxt('titanic.csv', delimiter=',', dtype=None, skip_header=1)

UnicodeDecodeError: 'charmap' codec can't decode byte 0x90 in position 169: character maps to <undefined>

In [9]:
titanic_data

NameError: name 'titanic_data' is not defined

In [10]:
titanic  = pd.read_csv('titanic.csv', sep=',')

In [11]:
titanic

    No Class     Sex    Age Survived Freq
0    1   1st    Male  Child       No    0
1    2   2nd    Male  Child       No    0
2    3   3rd    Male  Child       No   35
3    4  Crew    Male  Child       No    0
4    5   1st  Female  Child       No    0
5    6   2nd  Female  Child       No   0␊
6    7   3rd  Female  Child       No   17
7    8  Crew  Female  Child       No    0
8    9   1st    Male  Adult       No  118
9   10   2nd    Male  Adult       No  154
10  11   3rd    Male  Adult       No  387
11  12  Crew    Male  Adult       No  670
12  13   1st  Female  Adult       No    4
13  14   2nd  Female  Adult       No   13
14  15   3rd  Female  Adult       No   89
15  16  Crew  Female  Adult       No    3
16  17   1st    Male  Child      Yes    5
17  18   2nd    Male  Child      Yes   11
18  19   3rd    Male  Child      Yes   13
19  20  Crew    Male  Child      Yes    0
20  21   1st  Female  Child      Yes    1
21  22   2nd  Female  Child      Yes   13
22  23   3rd  Female  Child      Yes   14
23  24  Crew  Female  Child      Yes    0
24  25   1st    Male  Adult      Yes   57
25  26   2nd    Male  Adult      Yes   14
26  27   3rd    Male  Adult      Yes   75
27  28  Crew    Male  Adult      Yes  192
28  29   1st  Female  Adult      Yes  140
29  30   2nd  Female  Adult      Yes   80

# Excel  and Matlab .m File

In [1]:
import pandas as pd

In [2]:
file = pd.ExcelFile('ExcelTest.xlsx')

In [3]:
file.sheet_names

['s1', 's2']

In [4]:
df1 = file.parse('s1')
df2 = file.parse('s2')

In [6]:
df2

,10,Xerox 1980,Neola Schneider,807,-166.85,4.28,6.18,Nunavut,Paper,0.4
0,1,Advantus Map Pennant Flags and Round Head Tacks,Neola Schneider,807,-14.330,3.95,2.00,Nunavut,Rubber Bands,0.53
1,1,Holmes HEPA Air Purifier,Carlos Daly,868,134.720,21.78,5.94,Nunavut,Appliances,0.50
2,1,"DS/HD IBM Formatted Diskettes, 200/Pack - Staples",Carlos Daly,868,114.460,47.98,3.61,Nunavut,Computer Peripherals,0.71
3,1,"Wilson Jones 1"" Hanging DublLock® Ring Binders",Claudia Miner,933,-4.715,5.28,2.99,Nunavut,Binders and Binder Accessories,0.37
4,1,Ultra Commercial Grade Dual Valve Door Closer,Neola Schneider,995,782.910,39.89,3.04,Nunavut,Office Furnishings,0.53
5,1,"#10-4 1/8"" x 9 1/2"" Premium Diagonal Seam Enve...",Allen Rosenblatt,998,93.800,15.74,1.39,Nunavut,Envelopes,0.40
6,1,Hon 4-Shelf Metal Bookcases,Sylvia Foulston,1154,440.720,100.98,26.22,Nunavut,Bookcases,0.60
7,1,"Lesro Sheffield Collection Coffee Table, End T...",Sylvia Foulston,1154,-481.041,71.37,69.00,Nunavut,Tables,0.68
8,1,g520,Jim Radford,1344,-11.682,65.99,5.26,Nunavut,Telephones and Communication,0.59

In [7]:
from scipy.io import loadmat

In [8]:
X = loadmat('MatlabTest.mat')

In [9]:
X

{'__globals__': [],
 '__header__': b'MATLAB 5.0 MAT-file Platform: posix, Created on: Sun Jun 18 12:46:39 2017',
 '__version__': '1.0',
 'data': array([[['a', '1'],
         ['b', '2']]],
       dtype='<U1')}

In [10]:
X['data']

array([[['a', '1'],
        ['b', '2']]],
      dtype='<U1')

## Sqlite  - Relational Database

In [12]:
import sqlite3

In [13]:
conn = sqlite3.connect('SqliteTestDb.db')

In [14]:
cur = conn.cursor()

In [15]:
cur.execute("select * from employees")

In [16]:
rows = cur.fetchall()

In [17]:
for row in rows:
    print(row)

(1, 'Adams', 'Andrew', 'General Manager', None, '1962-02-18 00:00:00', '2002-08-14 00:00:00', '11120 Jasper Ave NW', 'Edmonton', 'AB', 'Canada', 'T5K 2N1', '+1 (780) 428-9482', '+1 (780) 428-3457', 'andrew@chinookcorp.com')
(2, 'Edwards', 'Nancy', 'Sales Manager', 1, '1958-12-08 00:00:00', '2002-05-01 00:00:00', '825 8 Ave SW', 'Calgary', 'AB', 'Canada', 'T2P 2T3', '+1 (403) 262-3443', '+1 (403) 262-3322', 'nancy@chinookcorp.com')
(3, 'Peacock', 'Jane', 'Sales Support Agent', 2, '1973-08-29 00:00:00', '2002-04-01 00:00:00', '1111 6 Ave SW', 'Calgary', 'AB', 'Canada', 'T2P 5M5', '+1 (403) 262-3443', '+1 (403) 262-6712', 'jane@chinookcorp.com')
(4, 'Park', 'Margaret', 'Sales Support Agent', 2, '1947-09-19 00:00:00', '2003-05-03 00:00:00', '683 10 Street SW', 'Calgary', 'AB', 'Canada', 'T2P 5G3', '+1 (403) 263-4423', '+1 (403) 263-4289', 'margaret@chinookcorp.com')
(5, 'Johnson', 'Steve', 'Sales Support Agent', 2, '1965-03-03 00:00:00', '2003-10-17 00:00:00', '7727B 41 Ave', 'Calgary', 'AB', 'Canada', 'T3B 1Y7', '1 (780) 836-9987', '1 (780) 836-9543', 'steve@chinookcorp.com')
(6, 'Mitchell', 'Michael', 'IT Manager', 1, '1973-07-01 00:00:00', '2003-10-17 00:00:00', '5827 Bowness Road NW', 'Calgary', 'AB', 'Canada', 'T3B 0C5', '+1 (403) 246-9887', '+1 (403) 246-9899', 'michael@chinookcorp.com')
(7, 'King', 'Robert', 'IT Staff', 6, '1970-05-29 00:00:00', '2004-01-02 00:00:00', '590 Columbia Boulevard West', 'Lethbridge', 'AB', 'Canada', 'T1K 5N8', '+1 (403) 456-9986', '+1 (403) 456-8485', 'robert@chinookcorp.com')
(8, 'Callahan', 'Laura', 'IT Staff', 6, '1968-01-09 00:00:00', '2004-03-04 00:00:00', '923 7 ST NW', 'Lethbridge', 'AB', 'Canada', 'T1H 1Y8', '+1 (403) 467-3351', '+1 (403) 467-8772', 'laura@chinookcorp.com')

In [18]:
df = pd.read_sql_query("select * from employees", conn)

In [19]:
df

,EmployeeId,LastName,FirstName,Title,ReportsTo,BirthDate,HireDate,Address,City,State,Country,PostalCode,Phone,Fax,Email
0,1,Adams,Andrew,General Manager,NaN,1962-02-18 00:00:00,2002-08-14 00:00:00,11120 Jasper Ave NW,Edmonton,AB,Canada,T5K 2N1,+1 (780) 428-9482,+1 (780) 428-3457,andrew@chinookcorp.com
1,2,Edwards,Nancy,Sales Manager,1.0,1958-12-08 00:00:00,2002-05-01 00:00:00,825 8 Ave SW,Calgary,AB,Canada,T2P 2T3,+1 (403) 262-3443,+1 (403) 262-3322,nancy@chinookcorp.com
2,3,Peacock,Jane,Sales Support Agent,2.0,1973-08-29 00:00:00,2002-04-01 00:00:00,1111 6 Ave SW,Calgary,AB,Canada,T2P 5M5,+1 (403) 262-3443,+1 (403) 262-6712,jane@chinookcorp.com
3,4,Park,Margaret,Sales Support Agent,2.0,1947-09-19 00:00:00,2003-05-03 00:00:00,683 10 Street SW,Calgary,AB,Canada,T2P 5G3,+1 (403) 263-4423,+1 (403) 263-4289,margaret@chinookcorp.com
4,5,Johnson,Steve,Sales Support Agent,2.0,1965-03-03 00:00:00,2003-10-17 00:00:00,7727B 41 Ave,Calgary,AB,Canada,T3B 1Y7,1 (780) 836-9987,1 (780) 836-9543,steve@chinookcorp.com
5,6,Mitchell,Michael,IT Manager,1.0,1973-07-01 00:00:00,2003-10-17 00:00:00,5827 Bowness Road NW,Calgary,AB,Canada,T3B 0C5,+1 (403) 246-9887,+1 (403) 246-9899,michael@chinookcorp.com
6,7,King,Robert,IT Staff,6.0,1970-05-29 00:00:00,2004-01-02 00:00:00,590 Columbia Boulevard West,Lethbridge,AB,Canada,T1K 5N8,+1 (403) 456-9986,+1 (403) 456-8485,robert@chinookcorp.com
7,8,Callahan,Laura,IT Staff,6.0,1968-01-09 00:00:00,2004-03-04 00:00:00,923 7 ST NW,Lethbridge,AB,Canada,T1H 1Y8,+1 (403) 467-3351,+1 (403) 467-8772,laura@chinookcorp.com

# Fetch Remote File

In [20]:
html_url = 'http://www.google.com' -- google
csv_url = 'https://vincentarelbundock.github.io/Rdatasets/csv/datasets/Titanic.csv'
json_url = 'https://raw.githubusercontent.com/ankit25587/test/master/test.json'

In [21]:
import requests

In [22]:
res = requests.get(html_url)

In [23]:
htmldata = res.text

In [25]:
from bs4 import BeautifulSoup

In [26]:
soup = BeautifulSoup(htmldata, 'html.parser')

In [28]:
soup.find('title').string

'Google'

In [29]:
res = requests.get(json_url)

In [30]:
res.text

'{\n  "firstName": "John",\n  "lastName": "Smith",\n  "isAlive": true,\n  "age": 25,\n  "address": {\n    "streetAddress": "21 2nd Street",\n    "city": "New York",\n    "state": "NY",\n    "postalCode": "10021-3100"\n  },\n  "phoneNumbers": [\n    {\n      "type": "home",\n      "number": "212 555-1234"\n    },\n    {\n      "type": "office",\n      "number": "646 555-4567"\n    },\n    {\n      "type": "mobile",\n      "number": "123 456-7890"\n    }\n  ],\n  "children": [],\n  "spouse": null\n}\n'

In [31]:
json_data = res.json()

In [32]:
json_data['firstName']

'John'

In [34]:
json_data['address']['postalCode']

'10021-3100'

In [35]:
import pandas as pd

In [37]:
df = pd.read_csv(csv_url)

In [38]:
df

,Unnamed: 0,Name,PClass,Age,Sex,Survived,SexCode
0,1,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,2,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,3,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,4,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,5,"Allison, Master Hudson Trevor",1st,0.92,male,1,0
5,6,"Anderson, Mr Harry",1st,47.00,male,1,0
6,7,"Andrews, Miss Kornelia Theodosia",1st,63.00,female,1,1
7,8,"Andrews, Mr Thomas, jr",1st,39.00,male,0,0
8,9,"Appleton, Mrs Edward Dale (Charlotte Lamson)",1st,58.00,female,1,1
9,10,"Artagaveytia, Mr Ramon",1st,71.00,male,0,0
10,11,"Astor, Colonel John Jacob",1st,47.00,male,0,0
11,12,"Astor, Mrs John Jacob (Madeleine Talmadge Force)",1st,19.00,female,1,1
12,13,"Aubert, Mrs Leontine Pauline",1st,NaN,female,1,1
13,14,"Barkworth, Mr Algernon H",1st,NaN,male,1,0
14,15,"Baumann, Mr John D",1st,NaN,male,0,0
15,16,"Baxter, Mrs James (Helene DeLaudeniere Chaput)",1st,50.00,female,1,1
16,17,"Baxter, Mr Quigg Edmond",1st,24.00,male,0,0
17,18,"Beattie, Mr Thomson",1st,36.00,male,0,0
18,19,"Beckwith, Mr Richard Leonard",1st,37.00,male,1,0
19,20,"Beckwith, Mrs Richard Leonard (Sallie Monypeny)",1st,47.00,female,1,1
20,21,"Behr, Mr Karl Howell",1st,26.00,male,1,0
21,22,"Birnbaum, Mr Jakob",1st,25.00,male,0,0
22,23,"Bishop, Mr Dickinson H",1st,25.00,male,1,0
23,24,"Bishop, Mrs Dickinson H (Helen Walton)",1st,19.00,female,1,1
24,25,"Bjornstrm-Steffansson, Mr Mauritz Hakan",1st,28.00,male,1,0
25,26,"Blackwell, Mr Stephen Weart",1st,45.00,male,0,0
26,27,"Blank, Mr Henry",1st,39.00,male,1,0
27,28,"Bonnell, Miss Caroline",1st,30.00,female,1,1
28,29,"Bonnell, Miss Elizabeth",1st,58.00,female,1,1
29,30,"Borebank, Mr John James",1st,NaN,male,0,0
...,...,...,...,...,...,...,...
1283,1284,"Vestrom, Miss Hulda Amanda Adolfina",3rd,14.00,female,0,1
1284,1285,"Vonk, Mr Jenko",3rd,22.00,male,0,0
1285,1286,"Ware, Mr Frederick",3rd,NaN,male,0,0
1286,1287,"Warren, Mr Charles William",3rd,NaN,male,0,0
1287,1288,"Wazli, Mr Yousif",3rd,NaN,male,0,0
1288,1289,"Webber, Mr James",3rd,NaN,male,0,0
1289,1290,"Wennerstrom, Mr August Edvard",3rd,NaN,male,1,0
1290,1291,"Wenzel, Mr Linhart",3rd,NaN,male,0,0
1291,1292,"Widegren, Mr Charles Peter",3rd,51.00,male,0,0
1292,1293,"Wiklund, Mr Jacob Alfred",3rd,18.00,male,0,0
1293,1294,"Wilkes, Mrs Ellen",3rd,45.00,female,1,1
1294,1295,"Willer, Mr Aaron",3rd,NaN,male,0,0
1295,1296,"Willey, Mr Edward",3rd,NaN,male,0,0
1296,1297,"Williams, Mr Howard Hugh",3rd,NaN,male,0,0
1297,1298,"Williams, Mr Leslie",3rd,28.00,male,0,0
1298,1299,"Windelov, Mr Einar",3rd,21.00,male,0,0
1299,1300,"Wirz, Mr Albert",3rd,27.00,male,0,0
1300,1301,"Wiseman, Mr Phillippe",3rd,NaN,male,0,0
1301,1302,"Wittevrongel, Mr Camiel",3rd,36.00,male,0,0
1302,1303,"Yalsevac, Mr Ivan",3rd,NaN,male,1,0
1303,1304,"Yasbeck, Mr Antoni",3rd,27.00,male,0,0
1304,1305,"Yasbeck, Mrs Antoni",3rd,15.00,female,1,1
1305,1306,"Youssef, Mr Gerios",3rd,NaN,male,0,0
1306,1307,"Zabour, Miss Hileni",3rd,NaN,female,0,1
1307,1308,"Zabour, Miss Tamini",3rd,NaN,female,0,1
1308,1309,"Zakarian, Mr Artun",3rd,27.00,male,0,0
1309,1310,"Zakarian, Mr Maprieder",3rd,26.00,male,0,0
1310,1311,"Zenni, Mr Philip",3rd,22.00,male,0,0
1311,1312,"Lievens, Mr Rene",3rd,24.00,male,0,0
1312,1313,"Zimmerman, Leo",3rd,29.00,male,0,0

# Facebook API

In [42]:
# https://developers.facebook.com/docs/graph-api/using-graph-api

In [44]:

# https://developers.facebook.com/tools/explorer/145634995501895/

In [45]:
token = 'EAACEdEose0cBAMfmNBrBInIZBqRSdiYTnoUhWn76vniwA8WS5A7ZCgDiy7WvLZBefjNBWfdSb6U3QzH36V8fQQ7ZAjswZB6v83o5mRGoc1rJu2x5LjutoUQmgiBxg4GMbZAvrpxIBRbbaZCQR80RYqBoorgUudu2kgH57JbWqJEGVR7U6dA8ilo6kOZCdyJJXW0ZD'

In [52]:
me = 'https://graph.facebook.com/v2.9/me?access_token='+token
friends = 'https://graph.facebook.com/v2.9/me/friends?access_token='+token
search= 'https://graph.facebook.com/v2.9/search?q=Mark&type=user&access_token='+token

In [53]:
import requests

me1 = requests.get(me)
friends1 = requests.get(friends)
search1 = requests.get(search)

In [49]:
me1.text

'{"name":"Ankit Mistry","id":"1414571596"}'

In [50]:
friends1.text

'{"data":[{"name":"Badrinath Kulkarni","id":"726850730"},{"name":"Vipul Vyas","id":"10202782061622152"},{"name":"Lalit Chandnani","id":"100000606782395"},{"name":"Prashant Kumar","id":"886422584733743"},{"name":"Bharathiraja Subramaniyan","id":"100001073329207"}],"paging":{"cursors":{"before":"QVFIUlE3d1Vad1pwLUFkVlAySFlaODhpc0M2YWhfWE5ZASmZA3S0wxOFlCZAWc5YV8wWnBCcHg0Mng0R1haVFpVWnpRN1cZD","after":"QVFIUmowa0IyX21JSllkOG5ET1dHRFE4eC1wVDNXOEd0clROeE5Ga0hNeDhBNmlValJNLXVmeVc1OE9GcTF4T0Vvb2RqUFdtN25QTmRRMXRzOVBSc2UyUlpn"}},"summary":{"total_count":402}}'

In [54]:
search1.text

'{"data":[{"name":"Mark Maglasang","id":"142137849672813"},{"name":"Wayne Mark Sager","id":"135769800488804"},{"name":"Mark Zuckerberg","id":"10101640953722381"},{"name":"Mark Connors","id":"828042037238121"},{"name":"Mark Mercado","id":"327832840993138"},{"name":"Mark Mayweather","id":"1330730660387473"},{"name":"Mark Santos","id":"10211786525272615"},{"name":"Mark Pentecost","id":"704210216284253"},{"name":"Mark Shea","id":"10152297596315218"},{"name":"Mark Zuckerberg","id":"10203099320099360"},{"name":"Mark Asian-Lover","id":"122218381514012"},{"name":"Mark Johnson","id":"884287731598609"},{"name":"Mark Likkel","id":"1654796921232119"},{"name":"Mujeres Del Markham Desnudas","id":"1046548842073860"},{"name":"Mark Pepper","id":"10205271970504472"},{"name":"Mark Derla Lim","id":"865841456778778"},{"name":"Markeith Rivers","id":"131105177617444"},{"name":"Mark Templeton","id":"1571718213061717"},{"name":"Mark Brantley","id":"10152749278166102"},{"name":"Mark Bareta","id":"10152903378542074"},{"name":"Mark Elkin","id":"10152720571996818"},{"name":"Mark Pardilla","id":"169197770234399"},{"name":"Mark J Reinhardt","id":"1001284373220220"}],"paging":{"next":"https:\\/\\/graph.facebook.com\\/v2.9\\/search?type=user&q=Mark&access_token=EAACEdEose0cBAMfmNBrBInIZBqRSdiYTnoUhWn76vniwA8WS5A7ZCgDiy7WvLZBefjNBWfdSb6U3QzH36V8fQQ7ZAjswZB6v83o5mRGoc1rJu2x5LjutoUQmgiBxg4GMbZAvrpxIBRbbaZCQR80RYqBoorgUudu2kgH57JbWqJEGVR7U6dA8ilo6kOZCdyJJXW0ZD&limit=25&offset=25&__after_id=enc_AdAFr67dUbK5aEBUaRtKggqz7PduGCpZCc92VlZCh3yqvYm4JHwsZAqEdCGMBZBm2zZBKj8D8ySbfkjEMrogJgvj3vmfV"}}'